Repository: ricardoaraujo330/woocommerce-reviews-for-google
Catalog: languages/woo-rfg-*.po
Languages: nl_nl

source: Please activate reviews in your merchant center first.
nl_nl: Activeer klant beoordelingen in uw Merchant Center eerst.

source: You can find this in your merchant center.
nl_nl: U kunt deze vinden in uw Merchant Center.

source: Delivery
nl_nl: Levering

source: If ordered before
nl_nl: Indien besteld voor

source: delivery on next day.
nl_nl: levering op de volgende dag.

source: Else delivery in
nl_nl: Anders levering in

source: days.
nl_nl: dagen.

source: Display Badge
nl_nl: Beoordeling weergeven

source: This is for showing your average review score
nl_nl: Dit is voor het tonen van uw gemiddelde review score

source: A Plugin to activate Google Customer Reviews in your Woocommerce store.
nl_nl: Een plugin om Google Customer Reviews in uw Woocommerce winkel te activeren.
